# На завод по изготовлению гирлянд пришел срочный заказ: изготовить как можно больше одинаковых гирлянд,
# состоящих из n лампочек. На складе завода есть лампочки k различных цветов, цвета занумерованы от 1 до k.
# Определите, сколько гирлянд сможет изготовить завод и из каких лампочек должна состоять каждая гирлянда.
# Формат ввода
# В первой строке задаются два числа n (1 ≤ n ≤ 40000) и k (1 ≤ k ≤ 50000).
# В следующих k строках задается количество лампочек каждого из k цветов. Суммарное количество лампочек на
# складе не превосходит 2 × 109.
# Формат вывода
# В первой строке выведите максимальное количество гирлянд. В следующих n строках выведите описание гирлянды:
# в каждой строке выведите номер цвета лампочки, находящейся в гирлянде на очередном месте. Если возможных
# ответов несколько — выведите любой из них.
# Пример
# Ввод	Вывод
# 3 4     2
# 3       1
# 3       2
# 2       3
# 1

# Пока неверное решение
n, k = map(int, input().split())
lamps = []
for i in range(1, k + 1):
    lamps.append((int(input()), i))
lamps.sort(key=lambda x: (-x[0], x[1]))
count = lamps[n - 1][0]
print(count)
for lamp in lamps[:n]:
    print(lamp[1])
