# Коллекционер Диего
# Диего увлекается коллекционированием наклеек. На каждой из них написано число, и каждый коллекционер
# мечтает собрать наклейки со всеми встречающимися числами.
# Диего собрал N наклеек, некоторые из которых, возможно, совпадают. Как-то раз к нему пришли K коллекционеров.
# i-й из них собрал все наклейки с номерами не меньшими, чем pi. Напишите программу, которая поможет каждому
# из коллекционеров определить, сколько недостающих ему наклеек есть у Диего. Разумеется, гостей Диего не
# интересуют повторные экземпляры наклеек.
# Формат ввода
# В первой строке содержится единственное число N (0 ≤ N ≤ 100 000) — количество наклеек у Диего.
# В следующей строке содержатся N целых неотрицательных чисел (не обязательно различных) — номера наклеек Диего.
# Все номера наклеек не превосходят 109.
# В следующей строке содержится число K (0 ≤ K ≤ 100 000) — количество коллекционеров, пришедших к Диего.
# В следующей строке содержатся K целых чисел pi (0 ≤ pi ≤ 109), где pi — наименьший номер наклейки,
# не интересующий i-го коллекционера.
# Формат вывода
# Для каждого коллекционера в отдельной строке выведите количество различных чисел на наклейках, которые
# есть у Диего, но нет у этого коллекционера.


def lbinpoisk(l, r, num):
    while l < r:
        m = (l + r) // 2
        if sticks[m] >= num:
            r = m
        else:
            l = m + 1
    return l


n = int(input())
sticks = [int(x) for x in input().split()]
k = int(input())
colects = [int(x) for x in input().split()]
sticks = list(sorted(set(sticks)))
n = len(sticks)
for col in colects:
    if col > sticks[-1]:
        print(n)
    elif col <= sticks[0]:
        print(0)
    else:
        res = lbinpoisk(0, n - 1, col)
        print(res)
