# Разноцветные палочки
# Есть 10 вертикальных палочек, пронумерованных от 0 до 9 и n колец трёх цветов красного «R», зеленого «G» и
# голубого «B», которые на надеты на палочки. Ваша задача по строке s, кодирующей, где находится каждое из колец
# определить количество палочек, на которое надеты кольца всех трёх цветов.
# Строка представляет из себя последовательность чётной длины, где на нечётных позициях (1, 3, 5 и т.д.) написан
# цвет кольца, а на чётных позициях (2, 4, 6 и т.д.) — номер палочки, на которую надето кольцо. Таким образом,
# кольцо номер i имеет цвет s2i−1 и находится на палочке номер s2i.
# Например, строка «R2G1R1B2G2» кодирует 5 колец:
# Первое кольцо имеет красный цвет и находится на палочке 2;
# Второе кольцо имеет зеленый цвет и находится на палочке 1;
# Третье кольцо имеет красный цвет и находится на палочке 1;
# Четвертое кольцо имеет синий цвет и находится на палочке 2;
# Пятое кольцо имеет зеленый цвет и находится на палочке 2;
# Формат ввода
# Первая строка входных данных  — это непустая строка четной длины s (1≤|s|≤1000), состоящая из символов «R»,
# «G» или «B» и цифр от 0 до 9.
# Формат вывода
# Выведите единственное целое число — количество палочек, на которых имеются кольца всех трёх цветов.
# Пример 1
# Ввод	      Вывод
# R2G1R1B2G2    1
# Пример 2
# Ввод	      Вывод
# R9G1B0        0

s = input()
n = len(s)
colors = [set() for _ in range(10)]
for i in range(1, n, 2):
    colors[int(s[i])].add(s[i-1])
answer = len(list(filter(lambda x: len(x) == 3, colors)))
print(answer)
