# Папа Карло сменил работу: теперь он работает в мастерской, и целый рабочий день занимается тем, что забивает гвоздики.
# Чтобы ему было не скучно, у него в мастерской стоит постоянно работающий телевизор. К сожалению,
# производительность папы Карло напрямую зависит от его настроения, а оно, в свою очередь, — от того,
# что в данный момент показывают по телевизору. Правда, пока папа Карло забивает гвоздик, он не обращает ни малейшего внимания на телевизор, и поэтому скорость его работы зависит только от того, что показывали по телевизору в тот момент, когда он только начал забивать этот гвоздик. Забив очередной гвоздик, он обязательно мельком смотрит в телевизор (его настроение, естественно, меняется), и после этого может либо сразу начать забивать следующий гвоздик, либо отдохнуть несколько секунд или даже минут за просмотром телевизора.
# Папа Карло начинает работу ровно в 9 часов. С 13 часов у него начинается обеденный перерыв. При этом
# если он незадолго до обеда хочет начать вбивать гвоздик, но понимает, что до перерыва он не закончит
# эту работу, то он и не начинает ее. Аналогично в 14 часов он вновь приступает к работе, а в 18 уходит
# домой. Это значит, что в 9:00:00 (аналогично, как и в 14:00:00) он уже может начать забивать гвоздик.
# Если он хочет начать вбивать гвоздик в 12:59:59 или 17:59:59 и на это у него уйдет 1 секунда, то он
# успевает вбить гвоздик до обеда или до окончания работы соответственно, а если 2 секунды, — то уже
# нет.
# Известна программа телевизионных передач и то, как они влияют на папу Карло. Требуется составить
# график работы и маленьких перерывчиков папы Карло так, чтобы за рабочий день он вбил максимально
# возможное количество гвоздей.
# Формат ввода
# Во входном файле записано расписание телевизионных передач с 9:00:00 до 18:00:00 в следующем формате.
# В первой строке число N — количество телевизионных передач в этот период (1≤N≤32400). В каждой из
# последующих N строк записано описание одной передачи: сначала время ее начала в формате ЧЧ:ММ:СС
# (ЧЧ — две цифры, задающие часы, ММ — две цифры, задающие минуты начала, СС — две цифры, задающие
# секунды начала). А затем через один или несколько пробелов число Ti — время в секундах, которое
# папа Карло будет тратить на забивание одного гвоздика, если он перед этим увидит по телевизору
# эту передачу (1≤Ti≤32400). Передачи записаны в хронологическом порядке. Первая передача всегда
# начинается в 09:00:00. Можно считать, что последняя передача заканчивается в 18:00:00.
# Формат вывода
# В первую строку выходного файла требуется вывести максимальное количество гвоздиков, которое папа
# Карло успеет вбить за рабочий день.
# Пример 1
# Ввод	       Вывод
# 2              8
# 09:00:00 3600
# 14:00:00 3600
# Пример 2
# Ввод	       Вывод
# 4              14
# 09:00:00 1800
# 12:59:31 10
# 13:45:23 1800
# 15:00:00 3600

n = int(input())
telecs = []
for _ in range(n):
    time, t = input().split()
    time_str = time.split(':')
    time_sec = int(time_str[0]) * 3600 + int(time_str[1]) * 60 + int(time_str[2]) - 9 * 3600
    telecs.append((time_sec, int(t)))
t1 = [0] * 14400
t2 = [0] * 14400
for i in range(len(telecs) - 1):
    if telecs[i][0] < 14400 and telecs[i + 1][0] <= 14400:
        for j in range(telecs[i][0], telecs[i + 1][0]):
            t1[j] = telecs[i][1]
    elif telecs[i][0] < 14400 and telecs[i + 1][0] > 14400:
        for j in range(telecs[i][0], 14400):
            t1[j] = telecs[i][1]
    elif telecs[i][0] >= 14400 and telecs[i][0] < 18000 and telecs[i + 1][0] > 18000:
        for j in range(0, telecs[i + 1][0] - 18000):
            t2[j] = telecs[i][1]
    elif telecs[i][0] >= 18000 and telecs[i + 1][0] <= 32400:
        for j in range(telecs[i][0] - 18000, telecs[i + 1][0] - 18000):
            t2[j] = telecs[i][1]
if telecs[-1][0] >= 18000:
    for j in range(telecs[-1][0] - 18000, 14400):
        t2[j] = telecs[-1][1]
elif telecs[-1][0] >= 14400 and telecs[-1][0] < 18000:
    for j in range(0, 14400):
        t2[j] = telecs[-1][1]
elif telecs[-1][0] < 14400:
    for j in range(telecs[-1][0], 14400):
        t1[j] = telecs[-1][1]
    for j in range(0, 14400):
        t2[j] = telecs[-1][1]

dp1 = [0] * 14400
dp2 = [0] * 14400
dp1[0] = 1 if t1[0] <= 14400 else 0
dp2[0] = 1 if t2[0] <= 14400 else 0

for i in range(1, 14400):
    dp1[i] = max(dp1[i - 1], dp1[i])
    dp2[i] = max(dp2[i - 1], dp2[i])
    if i + t1[i] < 14400:
        dp1[i + t1[i]] = max(dp1[i] + 1, dp1[i + t1[i]])
    if i + t2[i] < 14400:
        dp2[i + t2[i]] = max(dp2[i] + 1, dp2[i + t2[i]])
# print(dp1[-1])
# print(dp2[-1])
print(dp1[-1] + dp2[-1])
